n5/src/Documents/IncomingEmail/IncomingEmail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>IncomingEmail</name>
  <posting>Deny</posting>
  <attributes>
    <name>AttachmentsCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Brief</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Cc</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Importance</name>
    <type>
      <types>EnumRef.Importance</types>
    </type>
  </attributes>
  <attributes>
    <name>Key</name>
    <type>
      <types>CatalogRef.MailKeys</types>
    </type>
  </attributes>
  <attributes>
    <name>Mailbox</name>
    <type>
      <types>CatalogRef.Mailboxes</types>
    </type>
  </attributes>
  <attributes>
    <name>MessageID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Received</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Receiver</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiverName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReplyTo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Sender</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SenderName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerMessageID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Size</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Attachments</name>
    <attributes>
      <name>Extension</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>File</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Size</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Emails</name>
    <attributes>
      <name>Email</name>
      <type>
        <types>DocumentRef.IncomingEmail</types>
        <types>DocumentRef.OutgoingEmail</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/Documents/IncomingEmail/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var IsNew;

Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )
	
	IsNew = IsNew ();
	
EndProcedure

Procedure OnWrite ( Cancel )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	if ( DeletionMark ) then
		Documents.IncomingEmail.MarkAsRead ( Ref );
	else
		MailboxesSrv.AttachLabels ( Ref, IsNew, getLabel (), Mailbox );
		if ( IsNew ) then
			Documents.IncomingEmail.MarkAsNew ( Ref );
		endif; 
	endif; 
	
EndProcedure

Function getLabel ()
	
	if ( IsNew ) then
		return Catalogs.MailLabels.EmptyRef ();
	else
		return MailboxesSrv.GetLabel ( Ref );
	endif; 
	
EndFunction 

Procedure BeforeDelete ( Cancel )
	
	EmailsSrv.Clean ( MessageID, Mailbox );
	
EndProcedure

#endif
